MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/hal/rtl8733b/usb/rtl8733bu_xmit.c
/******************************************************************************
 *
 * Copyright(c) 2019 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _RTL8733BU_XMIT_C_

#include <drv_types.h>			/* PADAPTER, rtw_xmit.h and etc. */
#include <hal_data.h>			/* HAL_DATA_TYPE */
#include "../../hal_halmac.h"		/* halmac api */
#include "../rtl8733b.h"		/* rtl8733b_update_txdesc() */
#include "rtl8733bu.h"			/* OFFSET_SZ MAX_TX_AGG_PACKET_NUMBER_8733B */

static void update_txdesc_h2c_pkt(struct xmit_frame *pxmitframe, u8 *pmem, s32 sz)
{
	u8 *ptxdesc =  pmem;
	_adapter *padapter = pxmitframe->padapter;

	_rtw_memset(ptxdesc, 0, TXDESC_SIZE);
	SET_TX_DESC_TXPKTSIZE_8733B(ptxdesc, sz);
	SET_TX_DESC_QSEL_8733B(ptxdesc, HALMAC_TXDESC_QSEL_H2C_CMD);
	rtl8733b_cal_txdesc_chksum(padapter, ptxdesc);
	rtl8733b_dbg_dump_tx_desc(padapter, pxmitframe->frame_tag, ptxdesc);
}

static s32 update_txdesc(struct xmit_frame *pxmitframe, u8 *pmem, s32 sz, u8 bagg_pkt)
{
	int pull = 0;
	uint qsel;
	u8 data_rate, pwr_status, offset;
	_adapter *padapter = pxmitframe->padapter;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	struct pkt_attrib *pattrib = &pxmitframe->attrib;
	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);
	u8 *ptxdesc =  pmem;
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	sint bmcst = IS_MCAST(pattrib->ra);
	u16 SWDefineContent = 0x0;
	u8 DriverFixedRate = 0x0;
	u8 hw_port = rtw_hal_get_port(padapter);

#ifndef CONFIG_USE_USB_BUFFER_ALLOC_TX
	if (padapter->registrypriv.mp_mode == 0) {
		if ((PACKET_OFFSET_SZ != 0) && (!bagg_pkt)
		    && (rtw_usb_bulk_size_boundary(padapter, (TXDESC_SIZE + sz)) == _FALSE)) {
			ptxdesc = (pmem + PACKET_OFFSET_SZ);
			/* RTW_INFO("==> non-agg-pkt,shift pointer...\n"); */
			pull = 1;
		}
	}
#endif	/* !CONFIG_USE_USB_BUFFER_ALLOC_TX */

	_rtw_memset(ptxdesc, 0, TXDESC_SIZE);

	/* offset 0 */
	/* RTW_INFO("%s==> pkt_len=%d,bagg_pkt=%02x\n",__FUNCTION__,sz,bagg_pkt); */
	SET_TX_DESC_TXPKTSIZE_8733B(ptxdesc, sz);

	offset = TXDESC_SIZE + OFFSET_SZ;

#ifdef CONFIG_TX_EARLY_MODE
	if (bagg_pkt)
		offset += EARLY_MODE_INFO_SIZE;
#endif
	/* RTW_INFO("%s==>offset(0x%02x)\n",__FUNCTION__,offset); */
	SET_TX_DESC_OFFSET_8733B(ptxdesc, offset);

	if (bmcst)
		SET_TX_DESC_BMC_8733B(ptxdesc, 1);

#ifndef CONFIG_USE_USB_BUFFER_ALLOC_TX
	if (padapter->registrypriv.mp_mode == 0) {
		if ((PACKET_OFFSET_SZ != 0) && (!bagg_pkt)) {
			if ((pull) && (pxmitframe->pkt_offset > 0))
				pxmitframe->pkt_offset = pxmitframe->pkt_offset - 1;
		}
	}
#endif /* !CONFIG_USE_USB_BUFFER_ALLOC_TX */

	/* offset 4 */
	/* RTW_INFO("%s, pkt_offset=0x%02x\n",__FUNCTION__,pxmitframe->pkt_offset); */
	/* pkt_offset, unit:8 bytes padding */
	if (pxmitframe->pkt_offset > 0)
		SET_TX_DESC_PKT_OFFSET_8733B(ptxdesc, pxmitframe->pkt_offset);

	SET_TX_DESC_MACID_8733B(ptxdesc, pattrib->mac_id);
	SET_TX_DESC_RATE_ID_8733B(ptxdesc, pattrib->raid);

	SET_TX_DESC_QSEL_8733B(ptxdesc,  pattrib->qsel);

	/* offset 12 */
	if (!pattrib->qos_en) {
		/* HW sequence, to fix to use 0 queue. todo: 4AC packets to use auto queue select */
		SET_TX_DESC_EN_HWSEQ_8733B(ptxdesc, 1);/* Hw set sequence number */
		SET_TX_DESC_HW_SSN_SEL_8733B(ptxdesc, pattrib->hw_ssn_sel);
	} else
		SET_TX_DESC_SW_SEQ_8733B(ptxdesc, pattrib->seqnum);

	if ((pxmitframe->frame_tag & 0x0f) == DATA_FRAMETAG) {
		/* RTW_INFO("pxmitframe->frame_tag == DATA_FRAMETAG\n");	*/
		rtl8733b_fill_txdesc_sectype(pattrib, ptxdesc);
#ifdef CONFIG_TCP_CSUM_OFFLOAD_TX
	if (pattrib->hw_csum == 1) {
		int offset = 48 + pxmitframe->pkt_offset*8 + 24;

		SET_TX_DESC_OFFSET_8733B(ptxdesc, offset);
		SET_TX_DESC_CHK_EN_8733B(ptxdesc, 1);
		SET_TX_DESC_WHEADER_LEN_8733B(ptxdesc, (pattrib->hdrlen + pattrib->iv_len + XATTRIB_GET_MCTRL_LEN(pattrib))>>1);
	}
#endif

		/* offset 20 */
#ifdef CONFIG_USB_TX_AGGREGATION
		if (pxmitframe->agg_num > 1) {
			/* RTW_INFO("%s agg_num:%d\n",__FUNCTION__,pxmitframe->agg_num); */
			SET_TX_DESC_DMA_TXAGG_NUM_8733B(ptxdesc, pxmitframe->agg_num);
		}
#endif /* CONFIG_USB_TX_AGGREGATION */

		rtl8733b_fill_txdesc_vcs(padapter, pattrib, ptxdesc);

		if (bmcst)
			rtl8733b_fill_txdesc_force_bmc_camid(pattrib, ptxdesc);

		if ((pattrib->ether_type != 0x888e) &&
		    (pattrib->ether_type != 0x0806) &&
		    (pattrib->ether_type != 0x88b4) &&
		    (pattrib->dhcp_pkt != 1)
#ifdef CONFIG_AUTO_AP_MODE
		    && (pattrib->pctrl != _TRUE)
#endif
		   ) {
			/* Non EAP & ARP & DHCP type data packet */
			if (pattrib->ampdu_en == _TRUE) {
				SET_TX_DESC_AGG_EN_8733B(ptxdesc, 1);
				SET_TX_DESC_MAX_AGG_NUM_8733B(ptxdesc, 0x1f);
				/* Set A-MPDU aggregation */
				SET_TX_DESC_AMPDU_DENSITY_8733B(ptxdesc, pattrib->ampdu_spacing);
			} else
				SET_TX_DESC_BK_8733B(ptxdesc, 1);

			rtl8733b_fill_txdesc_phy(padapter, pattrib, ptxdesc);

			/* compatibility for MCC consideration, use pmlmeext->cur_channel */
			if (!bmcst) {
				if (pmlmeext->cur_channel > 14)
					/* for 5G. OFDM 6M */
					SET_TX_DESC_DATA_RTY_LOWEST_RATE_8733B(ptxdesc, 4);
				else
					/* for 2.4G. CCK 1M */
					SET_TX_DESC_DATA_RTY_LOWEST_RATE_8733B(ptxdesc, 0);
			}

			if (pHalData->fw_ractrl == _FALSE) {
				SET_TX_DESC_USE_RATE_8733B(ptxdesc, 1);
				DriverFixedRate = 0x01;

				if (pHalData->INIDATA_RATE[pattrib->mac_id] & BIT(7))
					SET_TX_DESC_DATA_SHORT_8733B(ptxdesc, 1);

				SET_TX_DESC_DATARATE_8733B(ptxdesc, (pHalData->INIDATA_RATE[pattrib->mac_id] & 0x7F));
			}
			if (bmcst) {
				DriverFixedRate = 0x01;
				rtl8733b_fill_txdesc_bmc_tx_rate(pattrib, ptxdesc);
			}

